_posts/2022-10-22-bit_tricks_count_bits_kernighan.html
---
layout: blogpost
title: Bit tricks - Counting the number of 1 bits (Kernighan algorithm)
tags: programming low-level retro-computing
---

<p>
It's been too long since the last bit tricks article, so I thought I would share another one! This time we will look at a simple fun bit trick to count the number of 1 bits in a binary string (e.g, a 32 bit integer). This algorithm was discovered by Brian Kernighan of Bell Labs and C fame. Unlike the previous algorithm presented in my bit tricks series, this one requires some branching. 
</p>



<p>
If you are interested in more bit tricks after reading this article, I also have an article on <a href="https://themkat.net/2022/02/14/bit_tricks_absolute_value_no_branching.html">absolute value without branching</a>.
</p>


<p>
I will refer to the structures we are working on as binary strings. Binary strings in this context is just a series of bits. It can be an integer, character, long, floating point number etc. For this algorithm you would off course have to convert it to a structure we could work with like an integer, but lucky for us, all of the previous types can be casted to something suitable.
</p>


<div id="outline-container-orgb0af57d" class="outline-2">
<h2 id="orgb0af57d">The algorithm</h2>
<div class="outline-text-2" id="text-orgb0af57d">
</div>
<div id="outline-container-org740dc02" class="outline-3">
<h3 id="org740dc02">Pseudo code and basics</h3>
<div class="outline-text-3" id="text-org740dc02">
<p>
How do we count the number of 1 bits in a binary string? One possible solution is to clear the lowest 1 bit in each step, and then count the number of steps needed for the input to become 0. This is the algorithm we will look at today. We will work on unsigned ints here, but it could easily have been chars, unsigned longs or something else. Unsigned because we want to count the number of bits, even for negative numbers, so we would have to cast signed variants to unsigned types. I find it easier to work on numbers where the lowest possible value is 0 in this case. The basic algorithm looks like this in a while-loop variant:
</p>

<div class="org-src-container">
<pre class="src src-c">unsigned int x = input;
unsigned int c = 0;
while (x &gt; 0) {
  x = x &amp; (x - 1);
  c++;
}
</pre>
</div>

<p>
Or as a for-loop variant:
</p>
<div class="org-src-container">
<pre class="src src-c">unsigned int x = input;
unsigned int c;
for (c = 0; x &gt; 0; c++) {
  x = x &amp; (x - 1);
}
</pre>
</div>

<p>
(<code>x = x &amp; (x - 1)</code> could also be written as <code>x &amp;=(x - 1)</code>)
</p>


<p>
So we do an operation <code>x &amp; (x - 1)</code> on an unsigned number (can also be a char, long etc.) until it is 0. So by doing this operation on x a number of times, we have the number of 1 bits stored in c (c stands for count). In short  <code>x &amp; (x - 1)</code> removes the lowest one bit in the binary number in each operation. How does this work? 
</p>
</div>
</div>

<div id="outline-container-orgf9e168a" class="outline-3">
<h3 id="orgf9e168a">Explaining the base step</h3>
<div class="outline-text-3" id="text-orgf9e168a">
<p>
We know from the previous section that  <code>x &amp; (x - 1)</code> removes the lowest 1 bit in each step. The first time you see it, it can be a bit confusing. I think it is best explained by looking at a few examples to gain some intuition. First of all, remember that the AND-operation (<code>&amp;</code>) only returns 1 if both bits are one. AND has the following truth-table (a and b are the input bits, result is the result of the operation):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">a</th>
<th scope="col" class="org-right">b</th>
<th scope="col" class="org-right">result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
(In case you haven't looked at binary operations in some time: Doing an AND operation on a binary string with multiple bits is simply doing the operation on each bit pair. first bit of a AND first bit of b, second bit of a AND second bit of b, &#x2026;, last bit of a AND last bit of b.)
</p>


<p>
To make the examples simple, they will be 8 bit data aka one byte. In my view, the easiest way to understand this algorithm is to do some binary subtractions yourself, and see how they behave. By looking at both x and x-1, we then see that the lowest one bit in the result has to be cleared. 
</p>
</div>


<div id="outline-container-org6ac9e10" class="outline-4">
<h4 id="org6ac9e10">Example input: 4</h4>
<div class="outline-text-4" id="text-org6ac9e10">
<p>
Let us first look at the number 4 (<code>00000100</code>). What is the result of doing the operation above:
</p>
<div class="org-src-container">
<pre class="src src-text">x:           00000100
x - 1:       00000011
x &amp; (x - 1): 00000000
</pre>
</div>

<p>
By looking at x and x-1, we see that the and-operation clearly has to have the result 0. The loop above would only run for one iteration here, and result in c=1 (number of 1 bits equal to 1). 
</p>
</div>
</div>

<div id="outline-container-org9be8436" class="outline-4">
<h4 id="org9be8436">Example input: 7</h4>
<div class="outline-text-4" id="text-org9be8436">
<div class="org-src-container">
<pre class="src src-text">x:           00000111
x - 1:       00000110
x &amp; (x - 1): 00000110
</pre>
</div>
</div>
</div>

<div id="outline-container-org32c8e75" class="outline-4">
<h4 id="org32c8e75">Example input: 25</h4>
<div class="outline-text-4" id="text-org32c8e75">
<div class="org-src-container">
<pre class="src src-text">x:           00011001
x - 1:       00011000
x &amp; (x - 1): 00011000
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8ad2a9" class="outline-4">
<h4 id="orgd8ad2a9">Example input: 24</h4>
<div class="outline-text-4" id="text-orgd8ad2a9">
<div class="org-src-container">
<pre class="src src-text">x:           00011000
x - 1:       00010111
x &amp; (x - 1): 00010000
</pre>
</div>

<p>
If you try to do the step again you have x (<code>00010000</code>), x-1 (<code>00001111</code>) and then <code>x&amp;(x-1)</code> = 0. For input number 24, we would then get c=2. 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd3c1547" class="outline-2">
<h2 id="orgd3c1547">Where can this be useful?</h2>
<div class="outline-text-2" id="text-orgd3c1547">
<p>
The most obvious place I can think of this as being useful is when you have encoded data into bits. One example include saving the on-off state of something like Conway's game of life into bits (each bit is an on-off cell in the grid). Then you can simply mask the data, and then count the number of bits to find adjacent neighbors. Choosing an algorithm for that case depends on if you are optimizing for speed of program size.
</p>


<p>
That being said, encoding into bits like this is not something most developers does today. The exception is off course some embedded programmers, and those of us who dabble in retro computing.
</p>
</div>
</div>
